stressTesting.yml
config:
  target: http://localhost:4000
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up

    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load

    - duration: 60
      arrivalRate: 10
      name: Sustained load

scenarios:

  - name: "Get all users"
    flow:
      - post:
          url: "/login"
          json:
            login: "admin"
            password: "admin"
          capture:
            - json: "$.token"
              as: "token"   
      - think: 1
      - get:
          url: "/users"
          headers:
             Authorization: "Bearer {{ token }}"

  - name: "Create a new user"
    flow:
      - post:
          url: "/login"
          json:
            login: "admin"
            password: "admin"
          capture:
            - json: "$.token"
              as: "token"
      - think: 1
      - post:
          url: "/users"
          headers:
             Authorization: "Bearer {{ token }}"
          json:
            name: "testUser"
            login: "testUser"
            password: "testUser"
          capture:
            - json: "$.id"
              as: "id"

  - name: "Create a new user and then get him by id"
    flow:
      - post:
          url: "/login"
          json:
            login: "admin"
            password: "admin"
          capture:
            - json: "$.token"
              as: "token"
      - think: 1
      - post:
          url: "/users"
          headers:
             Authorization: "Bearer {{ token }}"
          json:
            name: "testUser"
            login: "testUser"
            password: "testUser"
          capture:
            - json: "$.id"
              as: "id"
      - think: 1
      - get:
          url: "/users/{{ id }}"
          headers:
             Authorization: "Bearer {{ token }}"

  - name: "Create a new user and then update him"
    flow:  
      - post:
          url: "/login"
          json:
            login: "admin"
            password: "admin"
          capture:
            - json: "$.token"
              as: "token"
      - think: 1
      - post:
          url: "/users"
          headers:
             Authorization: "Bearer {{ token }}"
          json:
            name: "testUser"
            login: "testUser"
            password: "testUser"
          capture:
            - json: "$.id"
              as: "id"
      - think: 1
      - put:
          url: "/users/{{ id }}"
          headers:
             Authorization: "Bearer {{ token }}"
          json:
            name: "UpdatedtestUser"
            login: "UpdatedtestUser"
            password: "UpdatedtestUser"

  - name: "Create a new user and then delete him"
    flow:
      - post:
          url: "/login"
          json:
            login: "admin"
            password: "admin"
          capture:
            - json: "$.token"
              as: "token"
      - think: 1
      - post:
          url: "/users"
          headers:
             Authorization: "Bearer {{ token }}"
          json:
            name: "testUser"
            login: "testUser"
            password: "testUser"
          capture:
            - json: "$.id"
              as: "id"
      - think: 1
      - delete:
          url: "/users/{{ id }}"
          headers:
             Authorization: "Bearer {{ token }}"



# scenarios:
#   - name: "USER CRUD"
#     flow:
#       - post:
#           url: "/login"
#           json:
#             login: "admin"
#             password: "admin"
#           capture:
#             - json: "$.token"
#               as: "token"
#       - think: 1
#       - get:
#           url: "/users"
#           headers:
#              Authorization: "Bearer {{ token }}"
#       - think: 1
#       - post:
#           url: "/users"
#           headers:
#              Authorization: "Bearer {{ token }}"
#           json:
#             name: "testUser"
#             login: "testUser"
#             password: "testUser"
#           capture:
#             - json: "$.id"
#               as: "id"
#       - think: 1
#       - get:
#           url: "/users/{{ id }}"
#           headers:
#              Authorization: "Bearer {{ token }}"
#       - think: 1
#       - put:
#           url: "/users/{{ id }}"
#           headers:
#              Authorization: "Bearer {{ token }}"
#           json:
#             name: "UpdatedtestUser"
#             login: "UpdatedtestUser"
#             password: "UpdatedtestUser"
#       - think: 1
#       - delete:
#           url: "/users/{{ id }}"
#           headers:
#              Authorization: "Bearer {{ token }}"